context = "{\"slots\":{\"relation\":[\"爸爸\",\"爸爸\"]},\"execute_list\":[],\"domain\":\"baike\",\"intention\":\"relation\",\"scene\":\"baike.relation\"}";
function getAnswer(relation) {
    var relationMap = {};
    relationMap['爸爸'] = {
        '儿子': '哥哥,弟弟',
        '女儿': '姐姐,妹妹',
        '爸爸': '爷爷',
        '爷爷': '曾祖父',
        '奶奶': '曾祖母',
        '妈妈': '奶奶',
        '哥哥': '伯伯',
        '弟弟': '叔叔',
        '姐姐': '姑姑',
        '妹妹': '姑姑',
        '妻子': '妈妈'
    };
    relationMap['妈妈'] = {
        '儿子': '哥哥,弟弟',
        '女儿': '姐姐,妹妹',
        '爸爸': '外公',
        '妈妈': '外婆',
        '爷爷': '外曾祖父',
        '奶奶': '外曾祖母',
        '哥哥': '舅舅',
        '弟弟': '舅舅',
        '姐姐': '姨妈',
        '妹妹': '姨妈',
        '丈夫': '爸爸'
    };
    relationMap['丈夫'] = {
        '爸爸': '公公',
        '妈妈': '婆婆',
        '爷爷': '祖翁',
        '奶奶': '祖婆',
        '哥哥': '大伯哥',
        '弟弟': '小叔子',
        '姐姐': '大姑姐',
        '妹妹': '小姑子',
        '儿子': '儿子',
        '女儿': '女儿'
    };
    relationMap['妻子'] = {
        '爸爸': '岳父',
        '妈妈': '岳母',
        '爷爷': '太岳父',
        '奶奶': '太岳母',
        '哥哥': '大舅子',
        '弟弟': '小舅子',
        '姐姐': '大姨姐',
        '妹妹': '小姨子',
        '儿子': '儿子',
        '女儿': '女儿'
    };
    relationMap['爷爷'] = {
        '爸爸': '曾祖父',
        '妈妈': '曾祖母',
        '哥哥': '伯祖父',
        '弟弟': '叔祖父',
        '姐姐': '姑奶奶',
        '妹妹': '姑奶奶',
        '妻子': '奶奶',
        '儿子': '伯伯,爸爸,叔叔',
        '女儿': '姑姑'
    };
    relationMap['奶奶'] = {
        '爸爸': '曾外祖父',
        '妈妈': '曾外祖母',
        '哥哥': '舅公',
        '弟弟': '舅公',
        '姐姐': '姨奶奶',
        '妹妹': '姨奶奶',
        '丈夫': '爷爷',
        '儿子': '伯伯,爸爸,叔叔',
        '女儿': '姑姑'
    };
    relationMap['外公'] = {
        '爸爸': '外曾祖父',
        '妈妈': '外曾祖母',
        '哥哥': '伯外祖父',
        '弟弟': '叔外祖父',
        '姐姐': '姑姥姥',
        '妹妹': '姑姥姥',
        '妻子': '外婆',
        '儿子': '舅舅',
        '女儿': '姨妈,妈妈'
    };
    relationMap['外婆'] = {
        '爸爸': '外曾外祖父',
        '妈妈': '外曾外祖母',
        '哥哥': '外舅公',
        '弟弟': '外舅公',
        '姐姐': '姨姥姥',
        '妹妹': '姨姥姥',
        '丈夫': '外公',
        '儿子': '舅舅',
        '女儿': '姨妈,妈妈'
    };
    relationMap['姑姑'] = {
        '爸爸': '爷爷',
        '妈妈': '奶奶',
        '爷爷': '曾祖父',
        '奶奶': '曾祖母',
        '哥哥': '叔叔,爸爸,伯伯',
        '弟弟': '叔叔,爸爸,伯伯',
        '姐姐': '姑姑',
        '妹妹': '姑姑',
        '丈夫': '姑丈',
        '儿子': '姑表哥,姑表弟',
        '女儿': '姑表姐,姑表妹'
    };
    relationMap['姑丈'] = {
        '妻子': '姑姑',
        '儿子': '姑表哥,姑表弟',
        '女儿': '姑表姐,姑表妹'
    };
    relationMap['伯伯'] = {
        '爸爸': '爷爷',
        '妈妈': '奶奶',
        '爷爷': '曾祖父',
        '奶奶': '曾祖母',
        '哥哥': '伯伯',
        '姐姐': '姑姑',
        '弟弟': '伯伯,爸爸,叔叔',
        '妹妹': '姑姑',
        '妻子': '伯母',
        '儿子': '堂哥,堂弟',
        '女儿': '堂姐,堂妹'
    };
    relationMap['伯母'] = {
        '丈夫': '伯伯',
        '儿子': '堂哥,堂弟',
        '女儿': '堂姐,堂妹'
    };
    relationMap['叔叔'] = {
        '爸爸': '爷爷',
        '妈妈': '奶奶',
        '爷爷': '曾祖父',
        '奶奶': '曾祖母',
        '姐姐': '姑姑',
        '哥哥': '叔叔,爸爸,伯伯',
        '弟弟': '叔叔',
        '妹妹': '姑姑',
        '妻子': '婶婶',
        '儿子': '堂哥,堂弟',
        '女儿': '堂姐,堂妹'
    };
    relationMap['姨妈'] = {
        '爸爸': '外公',
        '妈妈': '外婆',
        '爷爷': '外曾祖父',
        '奶奶': '外曾祖母',
        '姐姐': '姨妈',
        '妹妹': '姨妈',
        '丈夫': '姨丈',
        '哥哥': '舅舅',
        '弟弟': '舅舅',
        '儿子': '表哥,表弟',
        '女儿': '表姐,表妹'
    };
    relationMap['姨丈'] = {
        '妻子': '姨妈',
        '儿子': '表哥,表弟',
        '女儿': '表姐,表妹'
    };
    relationMap['舅舅'] = {
        '爸爸': '外公',
        '妈妈': '外婆',
        '爷爷': '外曾祖父',
        '奶奶': '外曾祖母',
        '姐姐': '姨妈,妈妈',
        '妹妹': '姨妈,妈妈',
        '哥哥': '舅舅',
        '弟弟': '舅舅',
        '妻子': '舅妈',
        '儿子': '表哥,表弟',
        '女儿': '表姐,表妹'
    };
    relationMap['舅妈'] = {
        '丈夫': '舅舅',
        '儿子': '表哥,表弟',
        '女儿': '表姐,表妹'
    };
    relationMap['哥哥'] = {
        '弟弟': '哥哥,弟弟',
        '妹妹': '姐姐,妹妹',
        '爸爸': '爸爸',
        '妈妈': '妈妈',
        '爷爷': '爷爷',
        '奶奶': '奶奶',
        '外公': '外公',
        '外婆': '外婆',
        '哥哥': '哥哥',
        '姐姐': '姐姐',
        '妻子': '嫂子',
        '儿子': '侄子',
        '女儿': '侄女'
    };
    relationMap['嫂子'] = {
        '丈夫': '哥哥',
        '儿子': '侄子',
        '女儿': '侄女'
    };
    relationMap['姐姐'] = {
        '弟弟': '哥哥,弟弟',
        '妹妹': '姐姐,妹妹',
        '爸爸': '爸爸',
        '妈妈': '妈妈',
        '爷爷': '爷爷',
        '奶奶': '奶奶',
        '外公': '外公',
        '外婆': '外婆',
        '哥哥': '哥哥',
        '姐姐': '姐姐',
        '丈夫': '姐夫',
        '儿子': '外甥',
        '女儿': '外甥女'
    };
    relationMap['弟弟'] = {
        '哥哥': '哥哥,弟弟',
        '姐姐': '姐姐,妹妹',
        '爸爸': '爸爸',
        '妈妈': '妈妈',
        '爷爷': '爷爷',
        '奶奶': '奶奶',
        '外公': '外公',
        '外婆': '外婆',
        '弟弟': '弟弟',
        '妹妹': '妹妹',
        '妻子': '弟妹',
        '儿子': '侄子',
        '女儿': '侄女'
    };
    relationMap['妹妹'] = {
        '哥哥': '哥哥,弟弟',
        '姐姐': '姐姐,妹妹',
        '爸爸': '爸爸',
        '妈妈': '妈妈',
        '爷爷': '爷爷',
        '奶奶': '奶奶',
        '外公': '外公',
        '外婆': '外婆',
        '弟弟': '弟弟',
        '妹妹': '妹妹',
        '丈夫': '妹夫',
        '儿子': '外甥',
        '女儿': '外甥女'
    };
    relationMap['妹夫'] = {
        '妻子': '妹妹',
        '儿子': '外甥',
        '女儿': '外甥女'
    };
    relationMap['儿子'] = {
        '爸爸': '丈夫',
        '妈妈': '妻子',
        '哥哥': '儿子',
        '姐姐': '女儿',
        '弟弟': '儿子',
        '妹妹': '女儿',
        '妻子': '儿媳妇',
        '儿子': '孙子',
        '女儿': '孙女'
    };
    relationMap['儿媳妇'] = {
        '爸爸': '亲家公',
        '妈妈': '亲家母',
        '丈夫': '儿子',
        '儿子': '孙子',
        '女儿': '孙女'
    };
    relationMap['女儿'] = {
        '爸爸': '丈夫',
        '妈妈': '妻子',
        '哥哥': '儿子',
        '姐姐': '女儿',
        '弟弟': '儿子',
        '妹妹': '女儿',
        '丈夫': '女婿',
        '儿子': '外孙',
        '女儿': '外孙女'
    };
    relationMap['女婿'] = {
        '爸爸': '亲家公',
        '妈妈': '亲家母',
        '妻子': '女儿',
        '儿子': '外孙',
        '女儿': '外孙女'
    };
    var current = relation[0];
    for (var i = 1; i < relation.length; i++) {
        var next = relation[i];
        if (current in relationMap) {
            var nextRelationMap = relationMap[current];
            if (next in nextRelationMap) {
                current = nextRelationMap[next];
            } else {
                return '我也不知道';
            }
        } else {
            return '我也不知道';
        }
    }
    return current;
}
context = JSON.parse(context);
var data = {};
var answer = getAnswer(context.slots.relation);
if (answer != '我也不知道') {
    data['answer'] = '可以称呼为' + answer;
} else {
    data['answer'] = answer;
}
context['data'] = data;
context.slots.answer = answer;
console.log(context.slots.relation[0] + '的' + context.slots.relation[1] + '叫什么');
console.log(context.data.answer);
context = JSON.stringify(context);